Repository: teo-tsirpanis/Farkle
Catalog: src/FarkleNeo/Properties/Resources.*.resx
Languages: el

# Grammar_TooNewFormat
source: The grammar's format version is too new for this version of Farkle to support.
el: Η έκδοση μορφής της γραμματικής είναι πολύ νέα για να την υποστηρίξει αυτή η έκδοση του Farkle.

# Grammar_TooOldFormat
source: The grammar's format version is too old for this version of Farkle to support.
el: Η έκδοση μορφής της γραμματικής είναι πολύ παλιά για να την υποστηρίξει αυτή η έκδοση του Farkle.

# Grammar_EgtNeoNotSupported
source: EGTneo grammar files produced by Farkle 6.x are not supported.
el: Γραμματικές μορφής EGTneo που παρήχθησαν από το Farkle 6.x δεν υποστηρίζονται.

# Grammar_GoldParserMustConvert
source: Grammar files produced by GOLD Parser must be opened with the Grammar.CreateFromGoldParserGrammar method.
el: Γραμματικές που παρήχθησαν από το GOLD Parser πρέπει να ανοιχτούν με τη μέθοδο Grammar.CreateFromGoldParserGrammar.

# Grammar_UnrecognizedFormat
source: Unrecognized file format.
el: Μη αναγνωρισμένη μορφή αρχείου.

# Grammar_Farkle7MustOpen
source: Grammar files produced by Farkle 7 and above must be opened with the Grammar.Create method.
el: Γραμματικές που παρήχθησαν από το Farkle 7 και πάνω πρέπει να ανοιχτούν με τη μέθοδο Grammar.Create.

# Grammar_FailedToConvert
source: Failed to convert the grammar.
el: Αποτυχία μετατροπής της γραμματικής.

# Parser_ResultAlreadySet
source: The parsing operation has already set a result.
el: Η συντακτική ανάλυση έχει ήδη θέσει ένα αποτέλεσμα.

# Parser_ResultNotSet
source: The parsing operation has not yet set a result.
el: Η συντακτική ανάλυση δεν έχει θέσει ακόμα ένα αποτέλεσμα.

# ChainedTokenizerBuilder_NoGrammar
source: No grammar has been specified.
el: Δεν έχει δοθεί μία γραμματική.

# ChainedTokenizerBuilder_NoDefaultTokenizer
source: No default tokenizer has been specified.
el: Δεν έχει δοθεί ένας προεπιλεγμένος λεκτικός αναλυτής.

# Tokenizer_AlreadySuspended
source: The tokenizer has already been suspended.
el: Ο λεκτικός αναλυτής έχει ήδη παυθεί.

# Parser_UnrecognizedToken
source: Unrecognized token '{0}', expected {1}
el: Άγνωστο σύμβολο '{0}', αναμένονταν {1}

# Parser_UnexpectedEndOfInputInGroup
source: Unexpected end of input while being inside group '{0}'
el: Απροσδόκητο τέλος της εισόδου καθώς βρισκόταν μέσα στην ομάδα `{0}`

# Parser_UnexpectedToken
source: Found {0}, expected {1}
el: Βρέθηκε {0}, αναμένονταν {1}

# Parser_Eof
source: (EOF)
el: (ΤΕΛΟΣ)

# Parser_UnparsableGrammar
source: The grammar cannot be used for parsing or tokenizing because of an unspecified problem with it
el: Η γραμματική δεν μπορεί να χρησιμοποιηθεί για συντακτική ή λεκτική ανάλυση λόγω ενός ακαθόριστου προβλήματος με αυτήν

# Parser_UnparsableGrammar_Critical
source: The grammar cannot be used for parsing or tokenizing because it contains data not recognized by this version of Farkle
el: Η γραμματική δεν μπορεί να χρησιμοποιηθεί για συντακτική ή λεκτική ανάλυση επειδή περιέχει δεδομένα που δεν αναγνωρίζονται από αυτήν την έκδοση του Farkle

# Parser_GrammarLrMissing
source: The grammar cannot be used for parsing because it does not contain an LR state table
el: Η γραμματική δεν μπορεί να χρησιμοποιηθεί για συντακτική ανάλυση επειδή δεν έχει πίνακα καταστάσεων LR

# Parser_GrammarLrProblem
source: The grammar cannot be used for parsing because its LR state table has a problem
el: Η γραμματική δεν μπορεί να χρησιμοποιηθεί για συντακτική ανάλυση επειδή ο πίνακας καταστάσεων LR έχει κάποιο πρόβλημα

# Parser_GrammarDfaMissing
source: The grammar cannot be used for parsing because it does not contain a DFA
el: Η γραμματική δεν μπορεί να χρησιμοποιηθεί για λεκτική ανάλυση επειδή δεν έχει αυτόματο DFA

# Parser_GrammarDfaProblem
source: The grammar cannot be used for parsing because its DFA has a problem
el: Η γραμματική δεν μπορεί να χρησιμοποιηθεί για λεκτική ανάλυση επειδή το αυτόματο DFA έχει κάποιο πρόβλημα

# Builder_RegexCharacterRangeReverseOrder
source: Character range is in reverse order.
el: Το εύρος χαρακτήρων είναι σε αντεστραμμένη σειρά.

# Builder_RegexLoopRangeReverseOrder
source: Loop count range is in reverse order.
el: Το εύρος φορών επανάληψης είναι σε αντεστραμμένη σειρά.

# Builder_RegexLoopMaxTooBig
source: Loop upper bound cannot be greater or equal to 2147483647.
el: Το άνω όριο επανάληψης δεν μπορεί να είναι μεγαλύτερο ή ίσο του 2147483647.

# Builder_DfaStateLimitExceeded
source: DFA has exceeded the limit of {0} states
el: Το DFA έχει υπερβεί το όριο των {0} καταστάσεων

# Builder_IndistinguishableSymbols
source: Cannot distinguish between symbols: {0}
el: Δε μπορεί να γίνει διάκριση μεταξύ των συμβόλων: {0}

# Builder_RegexContainsVoid
source: Regex for symbol {0} (or part of it) cannot be matched by any character
el: Η κανονική έκφραση για το σύμβολο {0} (ή μέρος της οποίας) δεν μπορεί να αντιστοιχηθεί από κανέναν χαρακτήρα

# Builder_SymbolKind_Terminal
source: terminal
el: τερματικό

# Builder_SymbolKind_Noise
source: noise symbol
el: σύμβολο θορύβου

# Builder_SymbolKind_GroupStart
source: group start
el: έναρξη ομάδας

# Builder_SymbolKind_GroupEnd
source: group end
el: λήξη ομάδας

# Builder_Nonterminal_EmptyProductions
source: Cannot create nonterminal with no productions
el: Δε μπορεί να δημιουργηθεί μη τερματικό χωρίς παραγωγές

# Builder_Nonterminal_SetProductionsManyTimes
source: Cannot set productions of a nonterminal more than once
el: Δε μπορούν να τεθούν παραγωγές σε μη τερματικό πάνω από μία φορά

source: Warning
el: Προειδοποίηση

source: Error
el: Σφάλμα
